zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syslib.h
#if (CY_CPU_CORTEX_M7 || CY_CPU_CORTEX_M55)
/** Define start of the function placed to the ITCM area by the linker */
#ifndef CY_SECTION_ITCM_BEGIN
#define CY_SECTION_ITCM_BEGIN CY_SECTION(".cy_itcm")
#endif

/** Define end of the function placed to the ITCM area by the linker */
#ifndef CY_SECTION_ITCM_END
#define CY_SECTION_ITCM_END
#endif

/** Define start of the function placed to the DTCM area by the linker */
#ifndef CY_SECTION_DTCM_BEGIN
#define CY_SECTION_DTCM_BEGIN CY_SECTION(".cy_dtcm")
#endif

/** Define end of the function placed to the DTCM area by the linker */
#ifndef CY_SECTION_DTCM_END
#define CY_SECTION_DTCM_END
#endif
#endif /* CY_CPU_CORTEX_M7, CY_CPU_CORTEX_M55 */

/** Define start of the code block to be copied to SRAM by the linker during init */
#ifndef CY_SECTION_INIT_CODECOPY_BEGIN
#if defined (__ICCARM__)
#define CY_SECTION_INIT_CODECOPY_BEGIN CY_PRAGMA(default_function_attributes = @ "code_in_RAM")
#else
#define CY_SECTION_INIT_CODECOPY_BEGIN
#endif
#endif

/** Define end of the code block to be copied to SRAM by the linker during init */
#ifndef CY_SECTION_INIT_CODECOPY_END
#if defined (__ICCARM__)
#define CY_SECTION_INIT_CODECOPY_END CY_PRAGMA(default_function_attributes =)
#else
#define CY_SECTION_INIT_CODECOPY_END
#endif
#endif

/** Define variable to be placed to the shared SRAM area by the linker.  This memory region is un-cached for CM55 core */
#ifndef CY_SECTION_SHAREDMEM
#define CY_SECTION_SHAREDMEM CY_SECTION(".cy_sharedmem")
#endif

/** Define variable to be placed to the secured shared SRAM area by the linker */
#ifndef CY_SECTION_SHAREDMEM_SEC
#define CY_SECTION_SHAREDMEM_SEC CY_SECTION(".cy_sharedmem_sec")
#endif

/** Define start of code to be placed to the SOCMEMSRAM area by the linker */
#ifndef CY_SECTION_SOCMEMSRAMCODE_BEGIN
#define CY_SECTION_SOCMEMSRAMCODE_BEGIN CY_SECTION(".cy_socmem_code")
#endif

/** Define end of code placed to the SOCMEMSRAM area by the linker */
#ifndef CY_SECTION_SOCMEMSRAMCODE_END
#if defined (__GNUC__)
#define CY_SECTION_SOCMEMSRAMCODE_END
#endif
#endif

/** Define start of data to be placed to the SOCMEMSRAM area by the linker */
#ifndef CY_SECTION_SOCMEMSRAMDATA_BEGIN
#define CY_SECTION_SOCMEMSRAMDATA_BEGIN CY_SECTION(".cy_socmem_data")
#endif

/** Define end of code placed to the SOCMEMSRAM area by the linker */
#ifndef CY_SECTION_SOCMEMSRAMDATA_END
#if defined (__GNUC__)
#define CY_SECTION_SOCMEMSRAMDATA_END
#endif
#endif

/** Define start of shared data to be placed to the SOCMEMSRAM area by the linker. This memory region is un-cached for CM55 core */
#ifndef CY_SECTION_SOCMEMSRAMSHARED_BEGIN
#define CY_SECTION_SOCMEMSRAMSHARED_BEGIN CY_SECTION(".cy_shared_socmem")
#endif

/** Define end of shared data to be placed to the SOCMEMSRAM area by the linker */
#ifndef CY_SECTION_SOCMEMSRAMSHARED_END
#if defined (__GNUC__)
#define CY_SECTION_SOCMEMSRAMSHARED_END
#endif
#endif

/** Define start of function placed to the bootstrap area by the linker */
#ifndef CY_SECTION_BOOTSTRAP_FUNC_BEGIN
#if defined (__GNUC__)
#define CY_SECTION_BOOTSTRAP_FUNC_BEGIN CY_SECTION(".cy_l1func")
#endif
#endif

/** Define end of function placed to the bootstrap area by the linker */
#ifndef CY_SECTION_BOOTSTRAP_FUNC_END
#if defined (__GNUC__)
#define CY_SECTION_BOOTSTRAP_FUNC_END
#endif
#endif

/** Placed initialized global variable to the bootstrap data area by the linker */
#ifndef CY_SECTION_BOOTSTRAP_DATA
#if defined (__GNUC__)
#define CY_SECTION_BOOTSTRAP_DATA CY_SECTION(".cy_l1data")
#endif
#endif

/** Placed un-init global variable to the bootstrap bss area by the linker */
#ifndef CY_SECTION_BOOTSTRAP_BSS
#if defined (__GNUC__)
#define CY_SECTION_BOOTSTRAP_BSS CY_SECTION(".cy_l1bss")
#endif
#endif

/** Define start of the data placed in the SRAM0 area by the linker */
#ifndef CY_SECTION_SRAM0DATA_BEGIN
#define CY_SECTION_SRAM0DATA_BEGIN CY_SECTION(".cy_sram0_data")
#endif

/** Define end of the function placed to the ITCM area by the linker */
#ifndef CY_SECTION_SRAM0DATA_END
#define CY_SECTION_SRAM0DATA_END
#endif

#if defined(CY_IP_MXS40SSRSS)
typedef EFUSE_Type cy_syslib_lcs_data_t;    /**< Type of block with LCS data */
#elif defined(CY_IP_MXS22SRSS)
typedef SRSS_Type  cy_syslib_lcs_data_t;    /**< Type of block with LCS data */
#else
typedef uint32_t   cy_syslib_lcs_data_t;    /**< Type of block with LCS data */
#endif /* defined(CY_IP_MXS40SSRSS) */

#if defined(CY_IP_MXS40SSRSS)
typedef CM33_TRC_CTI_Type cy_syslib_debug_cti_t;    /**< Type of CTI block */
#else
typedef void              cy_syslib_debug_cti_t;    /**< Type of CTI block */
#endif /* defined(CY_IP_MXS40SSRSS) */

typedef void (* cy_israddress)(void);   /**< Type of ISR callbacks */
#if defined (__ICCARM__)
    typedef union { cy_israddress __fun; void * __ptr; } cy_intvec_elem;
#endif  /* defined (__ICCARM__) */

/* MISRA rule 6.3 recommends using specific-length typedef for the basic
 * numerical types of signed and unsigned variants of char, float, and double.
 */
typedef char     char_t;    /**< Specific-length typedef for the basic numerical types of char */
typedef float    float32_t; /**< Specific-length typedef for the basic numerical types of float */
typedef double   float64_t; /**< Specific-length typedef for the basic numerical types of double */

#if !defined(NDEBUG)
    /** The max size of the file name which stores the ASSERT location */
    #define CY_MAX_FILE_NAME_SIZE  (24U)
    extern CY_NOINIT char_t cy_assertFileName[CY_MAX_FILE_NAME_SIZE + 1];  /**< The assert buffer */
    extern CY_NOINIT uint32_t cy_assertLine;                           /**< The assert line value */
#endif /* NDEBUG */

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
    #define CY_R0_Pos             (0U)     /**< The position of the R0  content in a fault structure */
    #define CY_R1_Pos             (1U)     /**< The position of the R1  content in a fault structure */
    #define CY_R2_Pos             (2U)     /**< The position of the R2  content in a fault structure */
    #define CY_R3_Pos             (3U)     /**< The position of the R3  content in a fault structure */
    #define CY_R12_Pos            (4U)     /**< The position of the R12 content in a fault structure */
    #define CY_LR_Pos             (5U)     /**< The position of the LR  content in a fault structure */
    #define CY_PC_Pos             (6U)     /**< The position of the PC  content in a fault structure */
    #define CY_PSR_Pos            (7U)     /**< The position of the PSR content in a fault structure */
    #if (CY_CPU_CORTEX_M4 || (defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || \
         (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55)) && \
         ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
        #define CY_FPSCR_IXC_Msk  (0x00000010U)    /**< The cumulative exception bit for floating-point exceptions */
        #define CY_FPSCR_IDC_Msk  (0x00000080U)    /**< The cumulative exception bit for floating-point exceptions */
        #define CY_S0_Pos         (8U)     /**< The position of the FPU S0 content in a fault structure */
        #define CY_S1_Pos         (9U)     /**< The position of the FPU S1 content in a fault structure */
        #define CY_S2_Pos         (10U)    /**< The position of the FPU S2 content in a fault structure */
        #define CY_S3_Pos         (11U)    /**< The position of the FPU S3 content in a fault structure */
        #define CY_S4_Pos         (12U)    /**< The position of the FPU S4 content in a fault structure */
        #define CY_S5_Pos         (13U)    /**< The position of the FPU S5 content in a fault structure */
        #define CY_S6_Pos         (14U)    /**< The position of the FPU S6 content in a fault structure */
        #define CY_S7_Pos         (15U)    /**< The position of the FPU S7 content in a fault structure */
        #define CY_S8_Pos         (16U)    /**< The position of the FPU S8 content in a fault structure */
        #define CY_S9_Pos         (17U)    /**< The position of the FPU S9 content in a fault structure */
        #define CY_S10_Pos        (18U)    /**< The position of the FPU S10 content in a fault structure */
        #define CY_S11_Pos        (19U)    /**< The position of the FPU S11 content in a fault structure */
        #define CY_S12_Pos        (20U)    /**< The position of the FPU S12 content in a fault structure */
        #define CY_S13_Pos        (21U)    /**< The position of the FPU S13 content in a fault structure */
        #define CY_S14_Pos        (22U)    /**< The position of the FPU S14 content in a fault structure */
        #define CY_S15_Pos        (23U)    /**< The position of the FPU S15 content in a fault structure */
        #define CY_FPSCR_Pos      (24U)    /**< The position of the FPU FPSCR content in a fault structure */
    #endif /* (CY_CPU_CORTEX_M4 || CY_CPU_CORTEX_M7 || CY_CPU_CORTEX_M33 || CY_CPU_CORTEX_M55) && __FPU_PRESENT */

    extern CY_NOINIT cy_stc_fault_frame_t cy_faultFrame;    /**< Fault frame structure */
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */

/**
* \defgroup group_syslib_macros_assert Assert Classes and Levels
* \{
* Defines for the Assert Classes and Levels
*/

/**
* Class 1 - The highest class, safety-critical functions which rely on parameters that could be
* changed between different PSOC devices
*/
#define CY_ASSERT_CLASS_1           (1U)

/** Class 2 - Functions that have fixed limits such as counter periods (16-bits/32-bits etc.) */
#define CY_ASSERT_CLASS_2           (2U)

/** Class 3 - Functions that accept enums as constant parameters */
#define CY_ASSERT_CLASS_3           (3U)

#ifndef CY_ASSERT_LEVEL
    /** The user-definable assert level from compiler command-line argument (similarly to DEBUG / NDEBUG) */
    #define CY_ASSERT_LEVEL         CY_ASSERT_CLASS_3
#endif /* CY_ASSERT_LEVEL */

#if (CY_ASSERT_LEVEL == CY_ASSERT_CLASS_1)
    #define CY_ASSERT_L1(x)         CY_ASSERT(x)        /**< Assert Level 1 */
    #define CY_ASSERT_L2(x)         do{}while(false)    /**< Assert Level 2 */
    #define CY_ASSERT_L3(x)         do{}while(false)    /**< Assert Level 3 */
#elif (CY_ASSERT_LEVEL == CY_ASSERT_CLASS_2)
    #define CY_ASSERT_L1(x)         CY_ASSERT(x)        /**< Assert Level 1 */
    #define CY_ASSERT_L2(x)         CY_ASSERT(x)        /**< Assert Level 2 */
    #define CY_ASSERT_L3(x)         do{}while(false)    /**< Assert Level 3 */
#else /* Default is Level 3 */
    #define CY_ASSERT_L1(x)         CY_ASSERT(x)        /**< Assert Level 1 */
    #define CY_ASSERT_L2(x)         CY_ASSERT(x)        /**< Assert Level 2 */
    #define CY_ASSERT_L3(x)         CY_ASSERT(x)        /**< Assert Level 3 */
#endif /* CY_ASSERT_LEVEL == CY_ASSERT_CLASS_1 */

/** \} group_syslib_macros_assert */

#ifdef CY_IP_M33SYSCPUSS
/*******************************************************************************
* Macro Name: CY_UNUSED_PARAM
****************************************************************************//**
*
*  Suppresses the unused parameter warning
*
* \note
* This macro is available for devices having M33SYSCPUSS IP.
*
*******************************************************************************/
#define CY_UNUSED_PARAM(a) (void)(a)

