zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syslib.h
#if defined(CY_IP_M4CPUSS) || defined (CY_IP_M33SYSCPUSS) || defined (CY_IP_M55APPCPUSS)

/**
* \defgroup group_syslib_macros_unique_id Unique ID
* \{
* Unique ID fields positions
*/
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_YEAR_Pos       (57U)    /**< The position of the DIE_YEAR  field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_MINOR_Pos      (56U)    /**< The position of the DIE_MINOR field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_SORT_Pos       (48U)    /**< The position of the DIE_SORT  field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_Y_Pos          (40U)    /**< The position of the DIE_Y     field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_X_Pos          (32U)    /**< The position of the DIE_X     field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_WAFER_Pos      (24U)    /**< The position of the DIE_WAFER field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_2_Pos      (16U)    /**< The position of the DIE_LOT_2 field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_1_Pos      (8U)     /**< The position of the DIE_LOT_1 field in the silicon Unique ID */
/**
* \note
* This macro is available for devices having M4CPUSS and CY_IP_M33SYSCPUSS IP.
**/
#define CY_UNIQUE_ID_DIE_LOT_0_Pos      (0U)     /**< The position of the DIE_LOT_0 field in the silicon Unique ID */

/** \} group_syslib_macros_unique_id */
#endif

/** \} group_syslib_macros */

/******************************************************************************
* Function prototypes
******************************************************************************/

/**
* \addtogroup group_syslib_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysLib_Delay
****************************************************************************//**
*
* The function delays by the specified number of milliseconds.
* By default, the number of cycles to delay is calculated based on the
* \ref SystemCoreClock.
*
* \param milliseconds  The number of milliseconds to delay.
*
* \note The function calls \ref Cy_SysLib_DelayCycles() API to generate a delay.
*       If the function parameter (milliseconds) is bigger than
*       CY_DELAY_MS_OVERFLOW constant, then an additional loop runs to prevent
*       an overflow in parameter passed to \ref Cy_SysLib_DelayCycles() API.
*
* \note The Calibration factor is to correct the delay in cases where
*       CPU's use branch prediction, currently applicable for only CAT1C
*       devices.
*
*******************************************************************************/
void Cy_SysLib_Delay(uint32_t milliseconds);


/*******************************************************************************
* Function Name: Cy_SysLib_DelayUs
****************************************************************************//**
*
* The function delays by the specified number of microseconds.
* By default, the number of cycles to delay is calculated based on the
* \ref SystemCoreClock.
*
* \param microseconds  The number of microseconds to delay.
*
* \note If the CPU frequency is a small non-integer number, the actual delay
*       can be up to twice as long as the nominal value. The actual delay
*       cannot be shorter than the nominal one.
*
* \note The Calibration factor is to correct the delay in cases where
*       CPU's use branch prediction, currently applicable for only CAT1C
*       devices.
*
*******************************************************************************/
void Cy_SysLib_DelayUs(uint16_t microseconds);

/*******************************************************************************
* Function Name: Cy_SysLib_Rtos_Delay
****************************************************************************//**
*
* The function is same as \ref Cy_SysLib_Delay. However, this API is declared WEAK
* providing option for user to overwrite the implementation based on target RTOS.
*
* \param milliseconds  The number of milliseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_Rtos_Delay(uint32_t milliseconds);


/*******************************************************************************
* Function Name: Cy_SysLib_Rtos_DelayUs
****************************************************************************//**
*
* The function is same as \ref Cy_SysLib_DelayUs. However, this API is declared WEAK
* providing option for user to overwrite the implementation based on target RTOS.
*
* \param microseconds  The number of microseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_Rtos_DelayUs(uint16_t microseconds);


/*******************************************************************************
* Function Name: Cy_SysLib_DelayCycles
****************************************************************************//**
* Delays for the specified number of cycles.
*  The function is implemented in the assembler for each supported compiler.
*
*  \param cycles  The number of cycles to delay.
*
* \note While using for CAT1C devices, where the CPU supports branch prediction,
*  this API needs to be called as below
* Cy_SysLib_DelayCycles(cycles * CY_SYSLIB_DELAY_CALIBRATION_FACTOR);
* For Example:-
* CY_SYSLIB_DELAY_CALIBRATION_FACTOR = 1 for CM0P, CM33 and CM4.
* CY_SYSLIB_DELAY_CALIBRATION_FACTOR = 2 for CM7_0 and CM7_1.
*
*******************************************************************************/
void Cy_SysLib_DelayCycles(uint32_t cycles);


