zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_syslib.h
/*******************************************************************************
* Function Name: Cy_SysLib_GetDeviceRevision
****************************************************************************//**
*
* This function returns a device Revision ID.
*
* \return  A device Revision ID.
*
*******************************************************************************/
uint8_t Cy_SysLib_GetDeviceRevision(void);

/*******************************************************************************
* Function Name: Cy_SysLib_GetDevice
****************************************************************************//**
*
* This function returns a device Family ID.
*
* \return  A device Family ID.
*
*******************************************************************************/
uint16_t Cy_SysLib_GetDevice(void);


#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

#if defined (CY_IP_MXS40SSRSS)
/*******************************************************************************
* Function Name: Cy_SysLib_DebugSessionActive
****************************************************************************//**
*
* Indicates whether a debug session is active.
*
* \param base The pointer to the SRSS instance.
*
* \return true if a debug session is active, false otherwise.
*
*******************************************************************************/
bool Cy_SysLib_DebugSessionActive(SRSS_Type *base);

/*******************************************************************************
* Function Name: Cy_SysLib_DebugCtiMuxConnect
****************************************************************************//**
*
* Connects or disconnects a Cross Trigger Interface (CTI) input trigger to a
* CTI output trigger through a specified channel.
*
* \note Refer to the device TRM for the CTI input and output trigger indexes.
*
* \param base
* Pointer to the CTI instance \ref cy_syslib_debug_cti_t.
*
* \param inTrig
* Index of the CTI input trigger to be connected.
*
* \param outTrig
* Index of the CTI output trigger to be connected.
*
* \param channel
* Channel number to use for the connection.
*
* \param enable
* Set to true to connect the input and output triggers; false to disconnect.
*
*******************************************************************************/
void Cy_SysLib_DebugCtiMuxConnect(cy_syslib_debug_cti_t *base, uint32_t inTrig, uint32_t outTrig, uint8_t channel, bool enable);
#endif /* defined (CY_IP_MXS40SSRSS) */

/*******************************************************************************
* Function Name: Cy_SysLib_GetDeviceLCS
****************************************************************************//**
*
* This function returns LCS of Device.
*
* \param base The pointer to the SRSS instance.
*
* \return  \ref cy_en_syslib_lcs_mode_t
*
* \note
* eFuse must be in enabled state before calling this API.
*
*******************************************************************************/
cy_en_syslib_lcs_mode_t Cy_SysLib_GetDeviceLCS(cy_syslib_lcs_data_t *base);

/*******************************************************************************
* Function Name: Cy_Syslib_SetWarmBootEntryPoint
****************************************************************************//**
*
* This function will set Warm boot entry point address to a location read by
* BootROM. This function is used only before entering DeepSleep-RAM and not
* effective in any other sleep mode. Before entering CY_SYSPM_MODE_DEEPSLEEP_RAM,
* user needs to set entry point to a function located in RAM Image using
* Cy_Syslib_SetWarmBootEntryPoint(), refer Cy_SysPm_SetDeepSleepMode().
*
*  \param entryPoint Address of the function that needs to be entered after
* WARM boot.
*
*  \param enable Enables/Disables debugging control after DS-RAM wakeup
* i.e. warmboot
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_Syslib_SetWarmBootEntryPoint(uint32_t *entryPoint, bool enable);

/*******************************************************************************
* Function Name: Cy_SysLib_IsDSRAMWarmBootEntry
****************************************************************************//**
*
* This function will return true if the system woke up(From DS-RAM) through
* Warm boot, else it will return false.
*
* \return  Warm Boot Status.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
bool Cy_SysLib_IsDSRAMWarmBootEntry(void);

/*******************************************************************************
* Function Name: Cy_SysLib_ClearDSRAMWarmBootEntryStatus
****************************************************************************//**
*
* This function clears the Warm Boot entry Status flag.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysLib_ClearDSRAMWarmBootEntryStatus(void);
#endif

#if (CY_CPU_CORTEX_M55) || (CY_CPU_CORTEX_M7) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Syslib_IsMemCacheable
****************************************************************************//**
*
* This function checks if the memory address and the size passed falls in the
* non-cacheable region or not.
*
*  \param mpu Address of the MPU
*
*  \param addr Address of the memory to be checked
*
*  \param size Size of the memory to be checked
*
* \note
* This API is available for CM55 core on CAT1D devices.
*
*******************************************************************************/
bool Cy_Syslib_IsMemCacheable(MPU_Type* mpu, uint32_t addr, uint32_t size);
#endif

/** \cond INTERNAL */
#define CY_SYSLIB_DEVICE_REV_0A       (0x21U)  /**< The device TO *A Revision ID */
#define CY_SYSLIB_DEVICE_PSOC6ABLE2   (0x100U) /**< The PSOC6 BLE2 device Family ID */

#define CY_SYSLIB_COEFFICIENT_ULP     (80U) /**< Wait states coefficient for ULP mode  */
#define CY_SYSLIB_COEFFICIENT         (60U) /**< Wait states coefficient for general mode  */

